// pages/detail/detail.js
Page({

      /**
       * 页面的初始数据
       */
      data: {
        infeed: ["时间", "内容", "主持人", "地点"],
          endwise1: "8:30-8:50",
    tb1: "领导致欢迎辞(合影))",
          tb2: "杨书新",
          tb3: "",
        endwise2: "8:50-9:30",
        tc1: "特邀报告1: Al+ 无线通信(刘荣科教授,博导，北京航空航天大学电子信息工程学院副院长",
          tc2: "廖列法",
          tc3: "", 
        endwise3: "9:30-10:00",
        td1: "特邀报告2:面向智能制造的语义数据处理框架及应用(蔡鸿明教授，博导，上海交通大学软件学院)",
        td2: "廖列法",
        td3: "图书馆报告厅",  
        endwise4: "10:00-10:50",
        te1: "特邀报告3: 人机对话技术与应用(王小捷教授，博导，北京邮电大学)",
        te2: "张小红",
        te3: "",
        endwise5: "10:00-11:30",
        tf1: "特邀报告4:人体生物信号的建模、识别与应用(成谢锋教授，博导，南京邮电大学)",
        tf2: "张小红",
        tf3: "",
        endwise6: "14:00-15:30",
        tg1: "人工智能专业建设座谈",
        tg2: "廖列法",
        tg3: "信息楼S206",
    
        },

        /**
         * 生命周期函数--监听页面加载
         */
        onLoad: function(options) {

        },

        /**
         * 生命周期函数--监听页面初次渲染完成
         */
        onReady: function() {

        },

        /**
         * 生命周期函数--监听页面显示
         */
        onShow: function() {

        },

        /**
         * 生命周期函数--监听页面隐藏
         */
        onHide: function() {

        },

        /**
         * 生命周期函数--监听页面卸载
         */
        onUnload: function() {

        },

        /**
         * 页面相关事件处理函数--监听用户下拉动作
         */
        onPullDownRefresh: function() {

        },

        /**
         * 页面上拉触底事件的处理函数
         */
        onReachBottom: function() {

        },

        /**
         * 用户点击右上角分享
         */
        onShareAppMessage: function() {

        }
      })